create DATABASE hanghaeho;

use hanghaeho;
-- hanghaeho.genre definition

CREATE TABLE `genre`
(
    `create_at` datetime(6)  NOT NULL,
    `genre_id`  bigint       NOT NULL AUTO_INCREMENT,
    `modify_at` datetime(6)  DEFAULT NULL,
    `create_by` varchar(255) NOT NULL,
    `modify_by` varchar(255) DEFAULT NULL,
    `name`      varchar(255) NOT NULL,
    PRIMARY KEY (`genre_id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 11
  DEFAULT CHARSET = utf8mb4
  COLLATE = utf8mb4_0900_ai_ci;


-- hanghaeho.rating definition

CREATE TABLE `rating`
(
    `create_at` datetime(6)  NOT NULL,
    `modify_at` datetime(6)  DEFAULT NULL,
    `rating_id` bigint       NOT NULL AUTO_INCREMENT,
    `create_by` varchar(255) NOT NULL,
    `img`       varchar(255) NOT NULL,
    `modify_by` varchar(255) DEFAULT NULL,
    `name`      varchar(255) NOT NULL,
    PRIMARY KEY (`rating_id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 6
  DEFAULT CHARSET = utf8mb4
  COLLATE = utf8mb4_0900_ai_ci;


-- hanghaeho.screen definition

CREATE TABLE `screen`
(
    `create_at` datetime(6)  NOT NULL,
    `modify_at` datetime(6)  DEFAULT NULL,
    `screen_id` bigint       NOT NULL AUTO_INCREMENT,
    `create_by` varchar(255) NOT NULL,
    `modify_by` varchar(255) DEFAULT NULL,
    `name`      varchar(255) DEFAULT NULL,
    PRIMARY KEY (`screen_id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 28
  DEFAULT CHARSET = utf8mb4
  COLLATE = utf8mb4_0900_ai_ci;


-- hanghaeho.movie definition

CREATE TABLE `movie`
(
    `open_day`     date         NOT NULL,
    `running_time` int          NOT NULL,
    `create_at`    datetime(6)  NOT NULL,
    `genre_id`     bigint       NOT NULL,
    `modify_at`    datetime(6)  DEFAULT NULL,
    `movie_id`     bigint       NOT NULL AUTO_INCREMENT,
    `rating_id`    bigint       NOT NULL,
    `create_by`    varchar(255) NOT NULL,
    `modify_by`    varchar(255) DEFAULT NULL,
    `plot`         text,
    `thumbnail`    varchar(255) DEFAULT NULL,
    `title`        varchar(255) NOT NULL,
    PRIMARY KEY (`movie_id`),
    KEY `FK2ggat6246891h4goynp4h9lk5` (`genre_id`),
    KEY `FKi3po52aaiuuxadce3oltxllk5` (`rating_id`),
    CONSTRAINT `FK2ggat6246891h4goynp4h9lk5` FOREIGN KEY (`genre_id`) REFERENCES `genre` (`genre_id`),
    CONSTRAINT `FKi3po52aaiuuxadce3oltxllk5` FOREIGN KEY (`rating_id`) REFERENCES `rating` (`rating_id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 78
  DEFAULT CHARSET = utf8mb4
  COLLATE = utf8mb4_0900_ai_ci;


-- hanghaeho.seats definition

CREATE TABLE `seats`
(
    `seat_number` int          NOT NULL,
    `create_at`   datetime(6)  NOT NULL,
    `modify_at`   datetime(6)  DEFAULT NULL,
    `screen_id`   bigint       NOT NULL,
    `seat_id`     bigint       NOT NULL AUTO_INCREMENT,
    `create_by`   varchar(255) NOT NULL,
    `modify_by`   varchar(255) DEFAULT NULL,
    `seat_row`    varchar(255) NOT NULL,
    PRIMARY KEY (`seat_id`),
    KEY `FKns65s9saxppco52xust8jkvjx` (`screen_id`),
    CONSTRAINT `FKns65s9saxppco52xust8jkvjx` FOREIGN KEY (`screen_id`) REFERENCES `screen` (`screen_id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 676
  DEFAULT CHARSET = utf8mb4
  COLLATE = utf8mb4_0900_ai_ci;


-- hanghaeho.showing definition

CREATE TABLE `showing`
(
    `create_at`  datetime(6)  NOT NULL,
    `ed_time`    datetime(6)  DEFAULT NULL,
    `modify_at`  datetime(6)  DEFAULT NULL,
    `movie_id`   bigint       NOT NULL,
    `screen_id`  bigint       NOT NULL,
    `showing_id` bigint       NOT NULL AUTO_INCREMENT,
    `st_time`    datetime(6)  DEFAULT NULL,
    `create_by`  varchar(255) NOT NULL,
    `modify_by`  varchar(255) DEFAULT NULL,
    PRIMARY KEY (`showing_id`),
    KEY `FKinjmth3x5dxn65pkek5n2olsa` (`movie_id`),
    KEY `FKmq7ikbx6cmf2e59hni1qasrjo` (`screen_id`),
    CONSTRAINT `FKinjmth3x5dxn65pkek5n2olsa` FOREIGN KEY (`movie_id`) REFERENCES `movie` (`movie_id`),
    CONSTRAINT `FKmq7ikbx6cmf2e59hni1qasrjo` FOREIGN KEY (`screen_id`) REFERENCES `screen` (`screen_id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 194
  DEFAULT CHARSET = utf8mb4
  COLLATE = utf8mb4_0900_ai_ci;


-- hanghaeho.ticket definition

CREATE TABLE `ticket`
(
    `create_at`     datetime(6)                             NOT NULL,
    `modify_at`     datetime(6)  DEFAULT NULL,
    `seat_id`       bigint                                  NOT NULL,
    `showing_id`    bigint                                  NOT NULL,
    `ticket_id`     bigint                                  NOT NULL AUTO_INCREMENT,
    `create_by`     varchar(255)                            NOT NULL,
    `modify_by`     varchar(255) DEFAULT NULL,
    `ticket_status` enum ('COMPLETED','ON_SALE','RESERVED') NOT NULL,
    PRIMARY KEY (`ticket_id`),
    KEY `FK9k2k7dg03f83x7181m8gap19s` (`seat_id`),
    KEY `FKqot0hu7iv6bxhxdquxtcue4fn` (`showing_id`),
    CONSTRAINT `FK9k2k7dg03f83x7181m8gap19s` FOREIGN KEY (`seat_id`) REFERENCES `seats` (`seat_id`),
    CONSTRAINT `FKqot0hu7iv6bxhxdquxtcue4fn` FOREIGN KEY (`showing_id`) REFERENCES `showing` (`showing_id`)
) ENGINE = InnoDB
  DEFAULT CHARSET = utf8mb4
  COLLATE = utf8mb4_0900_ai_ci;

INSERT INTO hanghaeho.genre (create_at, genre_id, modify_at, create_by, modify_by, name)
VALUES ('2025-01-07 10:42:11.686768', 2, NULL, 'dbdb1114', NULL, '로맨스'),
       ('2025-01-07 10:42:11.686768', 3, NULL, 'dbdb1114', NULL, '드라마'),
       ('2025-01-07 10:42:11.686768', 4, NULL, 'dbdb1114', NULL, '스릴러'),
       ('2025-01-07 10:42:11.686768', 5, NULL, 'dbdb1114', NULL, '사극'),
       ('2025-01-07 10:42:11.686768', 6, NULL, 'dbdb1114', NULL, '다큐멘터리'),
       ('2025-01-07 10:42:11.686768', 7, NULL, 'dbdb1114', NULL, 'SF'),
       ('2025-01-07 10:42:11.686768', 8, NULL, 'dbdb1114', NULL, '가족'),
       ('2025-01-07 10:42:11.686768', 9, NULL, 'dbdb1114', NULL, '뮤지컬'),
       ('2025-01-07 10:42:11.686768', 10, NULL, 'dbdb1114', NULL, '액션');


INSERT INTO hanghaeho.rating (create_at, modify_at, rating_id, create_by, img, modify_by, name)
VALUES ('2025-01-07 10:51:47.843419', NULL, 1, 'dbdb1114',
        'https://i.namu.wiki/i/zWMpSgTLvx9-DvikX_ih8CcdVqp2vc0MoykD2HtvufYy6LbGjSFqJ7Vfzf_FrkCj_8aU1DBl6LF0LG3UwrjVXaR_FKR0HOkz7B1rZlMGQxtqwEthU-4Tb63eav69fi8MOsHajj-5BVbUcWafCUN46w.svg',
        NULL, '전체관람가'),
       ('2025-01-07 10:51:47.843419', NULL, 2, 'dbdb1114',
        'https://i.namu.wiki/i/YdStEpr0GjoLHPc9LS4Hm0589zwNpbZ9UjoABX_CkvKU7P6U787m-z1jFiL6UxlfbfVIun6_Ntk1AWxA2YjVRH7Xy7j1CL2mpZB8zHtJoQOh-gLb7-kgYQaYeTzCPc48ELOaEFSZMexxRuWpmmkhng.svg',
        NULL, '12세 이상 관람가'),
       ('2025-01-07 10:51:47.843419', NULL, 3, 'dbdb1114',
        'https://i.namu.wiki/i/76KpGR3vmwvcGkP4tszuGgm1P2eefPOCp85RjDiKyBYcVPhOOhctOcF2rnoKRg9nusgon1Z6cQO-rVdbPaiPzJX3ONKvmdH_iinYgsB7A89mCT7iEh0htEtMGP0fqfIXvDLOt1YzQ7fTz0wC6MAcSw.svg',
        NULL, '15세 이상 관람가'),
       ('2025-01-07 10:51:47.843419', NULL, 4, 'dbdb1114',
        'https://i.namu.wiki/i/Wi9l7OzgnsaMWnbg4s6NzllSpaYxBenB9cOhj5ozglHCEHPOxe1epMOKA1Wk2jKPabGMWzX0frFO3gKpg_3Rlg.svg',
        NULL, '18세 이상 관람가'),
       ('2025-01-07 10:51:47.843419', NULL, 5, 'dbdb1114',
        'https://i.namu.wiki/i/mj3AtfuIDt2-fH0yZ4KlvRNoVYqdUipkjEDVksfP_kTItdoyJJFTT3pjNl0MD6jc3sVfhbWyzk2ioAsn2zAfFxW1DPwPvylB1GWNu8XgjJpDgxPwoIiDkqGUVRtePo46YZED_jxl1xPvY-cjxBopAw.svg',
        NULL, '제한상영가');


INSERT INTO hanghaeho.movie (open_day, running_time, create_at, genre_id, modify_at, movie_id, rating_id, create_by,
                             modify_by, plot, thumbnail, title)
VALUES ('2021-01-01', 112, '2025-01-07 11:30:43.023639', 10, NULL, 1, 1, 'dbdb1114', NULL,
        '아버지를 죽인 범인을 찾기 위해 조직에 들어간 ‘지우’가 새로운 이름으로 경찰에 잠입한 후 마주하는 냉혹한 진실과 복수를 그린 넷플릭스 시리즈',
        'http://file.koreafilm.or.kr/thm/02/99/17/44/tn_DPK017920.jpg', ' 마이 네임'),
       ('2021-01-01', 112, '2025-01-07 11:30:43.023639', 3, NULL, 2, 4, 'dbdb1114', NULL,
        '외국인 노동자 인권을 보호하려는 여성 경찰의 노력과 성장에 대한 이야기', 'http://file.koreafilm.or.kr/thm/02/99/17/62/tn_DPK018764.jpg',
        ' 그녀가 온다'),
       ('2021-01-01', 92, '2025-01-07 11:30:43.023639', 4, NULL, 3, 1, 'dbdb1114', NULL,
        '엄마와 노래방을 운영하며 살고 있던 재필. 재필은 언젠가부터 알 수 없는 사람에게 협박문자를 받게 된다. 그리고 어느 날 친했던 동생과 사소한 시비 끝에 그만 폭력을 행사한다. 그 뒤 미안한 마음에 다시 동생을 찾아갔지만 동생은 의식을 잃은 상태였고 그때 다시 협박문자가 오는데…',
        'http://file.koreafilm.or.kr/thm/02/99/17/70/tn_DPK019057.jpg', ' 킬링톡'),
       ('2020-01-16', 94, '2025-01-07 11:30:43.023639', 10, NULL, 4, 3, 'dbdb1114', NULL,
        '국내 최악의 고등학교 ‘대훈고’에 입학한 최지훈. 그는 이곳에서 ‘짱’이 되겠다고 다짐하지만 현실은 그리 만만치 않다. 여기는 학교인가? 아니, 파이트 클럽이다. 한국 기성 장르 영화에 한 방을 먹이는 ‘코믹액션청춘대활극학원물!’',
        'http://file.koreafilm.or.kr/thm/02/00/05/41/tn_DPK015307.jpg', ' 갱'),
       ('2023-03-01', 96, '2025-01-07 11:30:43.023639', 4, NULL, 5, 2, 'dbdb1114', NULL,
        '“일 좀 할 만하면 그 분이 오시네. 대마 추출물이 효과가 있다 그러던데,” 역대급 나무를 키우는 전설의 농부가 한 분 있어.“삼류 용역 건달 조준은 격투 도중 심한 뇌전증 발작을 일으킨다.뇌전증에 효능이 있는 대마추출물은 2018년 의료사용이 국회를 통과했지만, 식약처의 시행령이 까다로워 보편적인 접근이 어려운 상태. 조준은 대마꾼 옛친구를 찾아 대마초를 배우는데.....처음 접한 대마초가 전설의 품질.“안 오는데?” “대자마자 오는 풀이 어딨냐?”조준과 현우가 전설의 대마초를 몰래 키우는 농부(초성)를 찾아나선다. 한편, 초성은 야산에서 자살을 하려던 여인 오미나를 구출. 여인이 잠든 사이 대마향을 피워 그녀의 상심한 마음을 달래주는데..... 회복한 오미나 자신을 마약꾼으로 만든 초성을 경찰에 고발하겠다며 반발 초성을 벼랑 끝까지 몰아붙일 때, 조준이 나타나 초성 앞에 엎드린다. “어르신 풀이 저를 구원했습니다. 저 여자는 제가 처리하겠습니다.” 대마초 때문에 삶의 의미를 깨달은 남자 조준과 본의 아니게 대마초를 흡입하게 된 여자 미나, 그리고 전설의 대마초를 탄생시킨 농부 초성의 비밀. 전창걸 감독의 개성있는 캐릭터 창조와 스토리 전개가 반전을 거듭하며 순식간에 시간을 삭제한다.전창걸 감독의 금지된 스토리가 시작된다',
        'http://file.koreafilm.or.kr/thm/02/99/17/97/tn_DPK020276.jpg', ' 떨'),
       ('2022-05-01', 112, '2025-01-07 11:30:43.023639', 7, NULL, 6, 4, 'dbdb1114', NULL,
        ' 당신의 예상을 빗나간다. 그녀는 직진이다. 터프한 성격의 영희는 노력은 하지만 공감능력이 전혀 없는 전남친을 뒤로 하고 완벽한 이상형에 가까운 철수에게 첫눈에 반한다. 그는 다를꺼라 생각하며 철수와 영희는 변함없는 사랑을 약속하고 주변에서 부러움을 살 정도로 알콩달콩 둘만의 사랑을 싹 틔운다. 전 남친은 관계정리가 깔끔하지 못했다는 이유로 스토킹 하며 둘을 괴롭히지만 그런 방해에도 불구하고 꿋꿋하게 사랑을 이어간다. 그렇게 행복하기만 한 둘에게 돌연 철수가 행방불명 되며 이야기는 다른 방향으로 흘러간다. 철수를 찾아 나서는 영희. 엎친데 덮친격으로 결혼하면 집장만을 위해같이 만든 통장에 돈이 전부 빠져있고 의심을 안 할수가 없는 상황이지만 영희는 철수를 믿으며 고군분투 추적끝에 전남친이 연관되어 있다는 생각을 한다. 과연 그 끝에 도달한 진실은 무엇일까. 영희의 고군분투 예측불허 로맨틱코미디가 시작된다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/68/tn_DPK018972.jpg', ' 영희'),
       ('2021-10-07', 82, '2025-01-07 11:30:43.023639', 4, NULL, 7, 4, 'dbdb1114', NULL,
        '이 집에 누군가 있는 것 같아..!공연을 할 수 없게 된 ‘승연’(조동혁)의 밴드는 재정비를 위해 춘천으로 떠나고, 우연히 그곳 클럽에서 멋진 실력을 보여준 그들은 정식 공연 제안과, 멋진 숙소까지 제공받게 된다.하지만 휴식도 잠시 기타리스트 ‘재혁’(차선우)이 뭔가에 홀린 듯 점점 섬뜩한 행동을 하기 시작하고, 곧 이 집에 자신들만 있는 게 아니라는 사실을 알게 되는데…',
        'http://file.koreafilm.or.kr/thm/02/99/17/40/tn_DPK017775.jpg', ' 피어썸'),
       ('2022-02-03', 105, '2025-01-07 11:30:43.023639', 3, NULL, 8, 4, 'dbdb1114', NULL,
        '평안도 월경촌에 마음 곱고 인물 반반하며 몸매도 빼어난 이름하야, 옹녀가 사는데, 문제는 팔자! 사주에 청상과부살이 겹겹이라 열다섯에 시집을 가는데 첫날밤에 남편이 급사한다. 열여섯에 다시 남편을 얻지만 역시 죽고, 열일곱, 열여덟, 열아홉, 스물…. 만나는 남편마다 해를 못 넘기고 죽어난다. 문제는 남편뿐만 아니라 과부 옹녀를 탐하거나 범하는 수많은 남자 역시 다 죽어난다는 것. 이러한 팔자 탓에 옹녀는 마을에서도 쫓겨난다. 남녘으로 가는 길에 도착한 곳이 황해도 청석골. 거기서 옹녀는 운명처럼 변강쇠를 만나는데, 궁합이 기막히게 잘 맞아 둘이 함께 도방살이(도회지 삶)를 시작한다. 그런데 옹녀가 한 푼 두 푼 잡일로 돈을 모으면 변강쇠가 도박과 술로 다 써버리니, 더 이상 도방에서는 살 수가 없다.어쩔 수 없이 지리산으로 들어간 변강쇠와 옹녀. 하지만 변강쇠는 산속에서도 노상 낮잠 자고 거시기만 한다. 보다 못한 옹녀가 나무라도 해오라고 성화하자 변강쇠가 장승을 뽑아 와서는 군불을 땐다. 이 일로 장승들이 분기탱천해 전국 회의를 열고 변강쇠에게 세상 만병을 줘서 시름시름 앓다가 죽게 하자는 결론을 내리는데….',
        'http://file.koreafilm.or.kr/thm/02/99/17/58/tn_DPA001511.jpg', ' 창극'),
       ('2020-02-01', 96, '2025-01-07 11:30:43.023639', 3, NULL, 9, 4, 'dbdb1114', NULL,
        '자타공인 구두쇠, 만두 영업을 하는 큰 형 ‘창순’, 여수 통합 싸움짱, 얼 짱 작은 형 ‘창규’, 아들만 셋인 집안의 막내로 태어나 형들의 과격(?)한 애정을 받아 상처도 많이 받고 맞기도 많이 맞은 우리의 ‘창은’ 철이 없는 건지, 운이 없는 건지, 인간 샌드백이 되어 버린, 지극히 평범한 가정집의 막내, ‘창은’, 화가 나도, 힘든 일이 있어도, 내색 한 번 못하는 전형적인 한국인, 착하 사람 콤플렉스 ‘창은’의 ‘창은’만 몰랐던 가슴 따뜻한 이야기.',
        'http://file.koreafilm.or.kr/thm/02/00/05/46/tn_DPK015429.jpg', ' 창은'),
       ('2021-06-04', 102, '2025-01-07 11:30:43.023639', 2, NULL, 10, 2, 'dbdb1114', NULL,
        '눈에서 멀어지면 마음에서도 멀어진다? 장거리 연애를 시작한 한 커플이 현실의 벽에 부딪힌다. 달콤했던 그들의 연애가 점점 쓴맛으로 변해가는 느낌. 아무리 애써봐도 소용없는 걸까?',
        'http://file.koreafilm.or.kr/thm/02/99/17/29/tn_DPK017056.jpg', ' 새콤달콤');
INSERT INTO hanghaeho.movie (open_day, running_time, create_at, genre_id, modify_at, movie_id, rating_id, create_by,
                             modify_by, plot, thumbnail, title)
VALUES ('2022-05-25', 95, '2025-01-07 11:30:43.023639', 10, NULL, 11, 3, 'dbdb1114', NULL,
        '국가정보원 국제범죄(마약)팀 소속 해수는 작전 중 사망한 동료를 대신해 하우스에서 ‘판때기’로 불리며 명성을 떨치고 있는 장판수를 급습, 정체불명 도박의 신 ''블랙잭''이 60억 원어치 마약을 노리고 있다는 사실을 알게 된다.이제 그를 잡을 방법은 단 하나뿐.해수는 맨몸으로 위험천만한 도박판에 직접 뛰어들기로 결심한다.목숨 건 죽음의 베팅이 시작된다!',
        'http://file.koreafilm.or.kr/thm/02/99/17/70/tn_DPK019049.jpg', ' 히든'),
       ('2021-01-01', 97, '2025-01-07 11:30:43.023639', 3, NULL, 12, 3, 'dbdb1114', NULL,
        ' 강원도 는 겨울 강원도에서 벌어지는 두 개의 스토리가 불규칙하게 교차하는 방식으로 구성된다. 입대를 앞둔 한 젊은 남자는 아버지를 찾아 철원에서 속초까지 여행을 떠난다. 한편 억압적인 남편으로부터 도망친 여자는 우연히 만난 남자의 도움을 받아 속초에서 철원 고향 집으로 돌아간다. 이렇게 같은 공간을 서로 반대 방향으로 걷는 두 사람의 이야기가 무관한 듯 펼쳐진다. 박기용 감독은 영화를 구상하며 이효석의 「메밀꽃 필 무렵」을 떠올렸다고 한다. 이 영화에서 소설과 유사한 요소들을 발견할 수 있다. 생면부지의 아버지와 아들, 소설 속 어머니와 비슷한 처지에서 도망 나온 여자. 그러나  강원도 는 소설의 충실한 각색과는 거리가 멀다.  강원도 는 인물들의 이야기보다 강원도라는 공간에 대한 영화라 할 수 있다. 그들이 지나가는 이 공간은 군사 분계선 인접지역으로써 한국사의 무게가 층층이 배어 있다. 영화 스토리 너머, 이곳을 살아간 사람들의 기억들이 희미하게 떠오른다.',
        'http://file.koreafilm.or.kr/thm/02/99/18/06/tn_DPK020612.jpg', ' 강원도'),
       ('2021-12-02', 91, '2025-01-07 11:30:43.023639', 2, NULL, 13, 3, 'dbdb1114', NULL,
        '변화를 통한 발전이라는 미명 하에 무자비한 자연 파괴를 일삼아 온 인류더 이상 비가 내리지 않고 인류는 각종 재해와 전염병의 창궐로 인해 서서히 위기를 맞이한다.‘신박사’는 자신이 만든 자연과 교감할 수 있는 인공지능 로봇(A01)이 인류의 마지막 수단이 되어버리자 로봇을 지키기 위해 모든 것을 포기한 채 은둔하며 숨어 지낸다.그러던 어느 날, 집요하게 그들을 좇고 있던 의문의 존재 ‘엑스’와의 추격전에서 로봇은 큰 부상을 입게 된다. 로봇의 치료를 위해 박사는 한적한 시골 어느 사찰에 숨어들게 되는데, 그곳에서 박사는 로봇에게 자신의 과거 이야기를 들려준다.이야기를 들으며 로봇은 인간의 실수와 미숙함, 참회의 감정 등을 느끼며 자연과의 교감능력이 업그레이드 되어가지만 결국 로봇은 엑스에게 납치되어 감금되고 박사는 로봇을 구하기 위해 엑스를 찾아 나선다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/51/tn_DPK018326.jpg', ' 기우제'),
       ('2021-10-07', 97, '2025-01-07 11:30:43.023639', 10, NULL, 14, 3, 'dbdb1114', NULL,
        '“첩보가 들어왔어요. 저희가 까죠?”정의감과 패기로 똘똘 뭉친 강력계 형사 ‘강수’.어느 날 그에게 마약 밀수입 등의 악질 범죄를 일삼는 거대 조직의 정보가 담긴 발신자 불명의 제보가 들어온다.범죄 소탕을 위해 조직에 위장 잠입한 ‘강수’는 회장의 오른팔 ‘용식’ 밑에서 조직 생활을 시작하고 각자의 목적을 위해 한 팀이 된 두 사람은 묘한 우정을 느낀다.“이런 일이 안 어울린다고, 강수 너한테는”한편, ‘강수’는 계속되는 비밀 수사 중 신분 들통 위기에 처하고 사건을 파헤칠수록 조직과 얽힌 충격적인 진실을 마주하는데…복수와 배신이 교차하는 세계에 뛰어든 두 남자,누구도 믿지 못할 팀플레이가 시작된다!',
        'http://file.koreafilm.or.kr/thm/02/99/17/42/tn_DPK017836.jpg', ' 브라더'),
       ('2023-01-01', 112, '2025-01-07 11:30:43.023639', 3, NULL, 15, 4, 'dbdb1114', NULL,
        '자신의 의사와는 관계없이 물속에 던져져 살기 위해 아가미가 생겨난 소년 ‘곤’,그를 건져낸 것은 ‘삶’의 아가미가 필요했던 강하와 강노인이었다. 아가미 는 각자의 상처를 지닌 사람들의 슬픈 운명에 대한 이야기이다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/66/tn_DPK018906.jpg', ' 아가미'),
       ('2021-12-08', 96, '2025-01-07 11:30:43.023639', 4, NULL, 16, 2, 'dbdb1114', NULL,
        '인생 역전을 꿈꾸며 도박을 시작한 ‘미미’.어느 날 밤, 정체불명의 괴한의 습격으로 눈 앞에서 가족을 잃는다.사건 현장에서 발견된 포커 카드를 입수한 ‘미미’는 수소문 끝에 비밀리에 운영되는 하우스 도박판 전용 카드임을 알아채고 배후를 찾기 위해 도박장에 입성한다.내로라하는 선수들만 모인 그 곳, 미스터리한 타짜 ‘오자와’를 만나며 평범했던 ‘미미’의 삶은 송두리째 뒤바뀐다.그 어떤 것도 예측할 수 없는 포커판에서 두 사람은 인생 최대 위기를 겪으며 목숨이 오가는 거대한 판에 뛰어드는데…',
        'http://file.koreafilm.or.kr/thm/02/99/17/47/tn_DPK018095.jpg', ' 여타짜'),
       ('2021-11-24', 89, '2025-01-07 11:30:43.023639', 10, NULL, 17, 4, 'dbdb1114', NULL,
        '한 동네 친구이자 초등학교 동창인 친구 여섯이 깊은 산장으로 MT를 떠난다. 회비로 먹을거리를 사고 잔돈 4천 원이 남자 로또를 사며 N분의 1로 나누기로 약속을 한다. 산장에 도착한 일행은 먼저 와 있던 토미와 어울려 술을 마시며 즐거운 시간을 보낸다. 이때 산으로 사냥을 나온 변호사 커플이 합류해 이들과 함께 한다. 밤이 깊어가는 시각, 그들이 산 로또는 1등에 당첨이 되고, 축하 분위기에 휩싸일 무렵, 총무이자 로또를 가지고 있던 혜진이 계곡에서 실족사를 하고 로또가 사라진다. 이후 토미가 의문의 죽임을 당하고 산장 안은 공포에 휩싸인다. 사람 좋은 미소를 짓던 산장지기는 사실 강간 살인범이자 탈옥수로, 진짜 산장지기를 죽이고 이 곳에 몸을 숨기고 있던 위험한 인물이었다. 나중에 합류한 동창 예린은 공금횡령으로 돈에 쫓기는 상황에서 먼저 온 동창들과 힘을 합쳐 그와 대항하지만 친구들의 죽음이 계속되고, 로또의 행방도 묘연하다. 여기에 알고 보니 변호사 역시 보석 강도로, 가지고 있는 사냥총으로 로또 확보 전쟁에 참여하면서 산장은 탐욕의 그림자로 물들며 최종적으로 73억을 독차지하기 위해 끝까지 한 명이 남을 때까지 서로의 생명을 위협한다. 고립된 산장에서 73억이라는 돈이 눈앞에 주인 없이 나타나면서 인간이 보여주는 탐욕의 끝과 서서히 물들어가는 복잡한 인간 본성의 심리 변화를 관객들에게 보여준다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/40/tn_DPK017770.jpg', ' 로또쉐어'),
       ('2021-05-05', 145, '2025-01-07 11:30:43.023639', 9, NULL, 18, 3, 'dbdb1114', NULL,
        '어느 날 베르테르는 자석산에 대한 인형극을 하며 신비한 모험에 들뜬 롯데의 싱그러움에 단숨에 매료되고 롯데는 시에 공감하는 베르테르에게 유대감을 느낀다. 베르테르는 롯데에 대한 사랑을 확신하지만 약혼자 알베르트가 있다는 사실에 마음이 무너진다. 알베르트는 롯데와의 평화로운 삶을 지키려 하고 베르테르는 차마 그들의 행복을 지켜볼 수 없어 떠난다. 그러나 긴 여행 끝에도 롯데를 잊지 못해 발하임으로 돌아오는데...',
        'http://file.koreafilm.or.kr/thm/02/99/17/26/tn_DPA001279.jpg', ' 베르테르'),
       ('2020-07-01', 83, '2025-01-07 11:30:43.023639', 3, NULL, 19, 2, 'dbdb1114', NULL,
        '유명한 소설가 조성치의 사무실의 의문의 도둑들이 침입한다. 도둑들은 조성치에게 사무실 금고를 열라고 요구하지만 조성치 역시 금고의 비밀번호를 맞추느라 애를 먹는다. 시간이 지날수록 어딘가 어설픈 도둑들은 조성치에게 휘둘리게 되는데...',
        'http://file.koreafilm.or.kr/thm/02/99/17/03/tn_DPK016182.jpg', ' 디재스터 라이프'),
       ('2021-09-01', 96, '2025-01-07 11:30:43.023639', 2, NULL, 20, 2, 'dbdb1114', NULL,
        '한 장의 편지로 시작된 그 날의 기억들.유튜브 라디오 채널을 운영하는 희철. 어느 날 한 장의 편지로 된 사연이 도착하고, 그 편지 속에는 풋풋했던 두 남녀의 따뜻하고 아름다운 연애 이야기가 담겨있는데... 매주 사연을 읽어가면서 점차 편지 속의 주인공에 대한 궁금증과 이해할 수 없는 의미심장한 말들이 희철의 가슴을 파고들고, 끝내 희철은 지난 날 들에 대한 기억들이 불현듯 떠오른다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/36/tn_DPK017409.jpg', ' 수필러브');
INSERT INTO hanghaeho.movie (open_day, running_time, create_at, genre_id, modify_at, movie_id, rating_id, create_by,
                             modify_by, plot, thumbnail, title)
VALUES ('2020-04-09', 91, '2025-01-07 11:30:43.023639', 10, NULL, 21, 4, 'dbdb1114', NULL,
        '격동의 일제 강점기를 배경으로 조선 학생 주먹 1인자 최강일과 반일독서회를 해체시키려는 야쿠자 겐지 일당의 대결을 그린 정통 액션영화',
        'http://file.koreafilm.or.kr/thm/02/00/05/52/tn_DPK015657.jpg', ' 조선주먹'),
       ('2021-08-19', 116, '2025-01-07 11:30:43.023639', 3, NULL, 22, 3, 'dbdb1114', NULL,
        '단편영화  감자 를 완성한 네 배우는 불러주지도 않은 칸 영화제에 가야 되나 고민한다. 그러다 칸 영화제 결과를 기다리는 내용으로 영화를 찍기로 하는데, 그 영화 찍기가 실패하는 비슷한 내용이 몇 번 반복된다. 결국  감자 는 칸뿐만 아니라 정동진영화제, 무주산골영화제 등에서도 탈락의 고배를 마신다.몇 달 후, 절치부심한 그들은 장편영화를 찍기로 한다. 그것은 평행우주를 이동하는 어떤 남자가 ‘봉준호’라는 이세계(異世界) 감독의 흥행작이라며 건넨 이야기이다. 그렇게 그들은  살인의 추억 이라는 저예산 독립영화를 만들기 시작한다. 과연 네 배우는 영화를 통해 영화를 누리게 될 수 있을까.',
        'http://file.koreafilm.or.kr/thm/02/99/17/38/tn_DPK017541.jpg', ' 어댑테이션'),
       ('2021-01-01', 95, '2025-01-07 11:30:43.023639', 2, NULL, 23, 2, 'dbdb1114', NULL,
        '“선배, 그 새끼 따라가지 말아요!” 한창 사랑하고 성적 욕구가 강할 나이 이십 대 청춘. 선희.그녀는 늘 첫사랑과의 로맨틱한 키스를 꿈꾸는 풋풋한 여대생이다.3선 시의원인 아버지를 위해 갖은 사회 봉사 활동에 참여해왔다.그런 그녀가 유일하게 자신만을 위해 가는 봉사 활동이 하나 있었는데, 그게 바로 첫사랑 진수가 있는 보육원이다.보육원 원장 아들인 진수 선배.젠틀하고 항상 따뜻하게 대해주는 그를 보기 위해 득달같이 달려가는 선희다.이런 선희를 위한 달콤한 제안이 하나 들어오는데 바로 진수와의 첫 키스!과연 선희는 주변의 라이벌을 물리치고 진수와의 달콤한 키스에 성공할 수 있을까? “내가 가자고 한 건데?” 그리고 같은 듯 다른 이유로 고민하는 또 다른 청춘, 남학생 준석이 있다.선희 선배 사랑해요…선희와의 우연한 첫 키스, 그 순간 만큼은 이루었으나 그건 어디까지나 작은 접촉 사고(?) 같은 것 일뿐.자신을 그저 동생, 후배 정도로만 여기는 선희에 전전긍긍하기 일수다.그저 같은 봉사 활동을 하며 한편에서 바라봐야만 하는 순수청년인 준석…과연 선희와의 첫사랑이 이뤄질 수 있을까?',
        'http://file.koreafilm.or.kr/thm/02/99/18/00/tn_DPK020352.jpg', ' 오마이키스'),
       ('2022-08-18', 116, '2025-01-07 11:30:43.023639', 9, NULL, 24, 2, 'dbdb1114', NULL,
        '해가 뜨지 않는 어둠의 저주가 세상에 내리고 차가운 심장을 가진 투란도트는 아름다운 미모로 수많은 남자들의 청혼을 받는다.그녀는 청혼을 받아들이는 조건으로 세 가지 수수께끼를 내고 이를 풀지 못한 자는 돌로 변해 죽고 만다.바르칸 왕국의 왕자, 칼라프도 수수께끼를 풀고 청혼하는데…진정한 사랑을 믿지 않는 여인, 투란도트.그녀의 심장을 움직일 단 한 사람, 칼라프.둘의 운명은 과연 어떻게 될 것인가..',
        'http://file.koreafilm.or.kr/thm/02/99/17/73/tn_DPK019181.jpg', ' 투란도트: 어둠의 왕국'),
       ('2020-01-23', 90, '2025-01-07 11:30:43.023639', 3, NULL, 25, 3, 'dbdb1114', NULL,
        '뇌수술을 받아야 하는 진무는 수술 후에 기억을 잃을 수 있다는 말을 듣고 기억해야 하는 것을 캠코더에 담기 시작한다. 진무는 그 과정에서 가족들에 대한 기억과 기억나지 않던 아버지를 떠올리게 된다.',
        'http://file.koreafilm.or.kr/thm/02/00/05/42/tn_DPK015332.jpg', ' 작은 빛'),
       ('2022-01-19', 137, '2025-01-07 11:30:43.023639', 2, NULL, 26, 3, 'dbdb1114', NULL,
        '2021년의 오하린. 아무리 웃어보려고, 씩씩하게 살아보려 애써도 남들 앞에서 드러내기 힘든, 지워지지 않는 상처가 있다. 그건 바로 10년 전 생일날, 유일한 남사친이자 짝사랑이었던 서준의 자살이다. 십 년이다 십 년. 초등학교 때부터 지금까지 쭉 가장 가까운 사이. 티격태격 서로의 제일 가까운 남사친 여사친으로 지내왔는데. 어느 날 문득 정신을 차려보니 가랑비에 옷 젖듯 남몰래 좋아하고 있었다. 가장 행복해야 할 생일날, 감춰왔던 마음을 고백하려 용기를 낸 순간 서준은 거짓말처럼 떠나버렸다.홀로 남겨진 하린은 10년 후 생일날, 서준의 유품인 카메라와 그가 찍었던 8장의 사진을 다시 갖게 되는데.서준의 기억을 다시 떠올리는 게 너무 아픈 하린은 슬픈 마음에 사진을 태워버린다. 그런데 정신을 차리고 보니, 사진 속 십 년 전 그날로 돌아가 있는 것이다! 서준은 왜 자살을 했을까? 그의 죽음은 정말 자살이 맞을까?서준의 카메라에서 나온 사진은 단 여덟 장. 시간 여행을 할 수 있는 기회도 단 여덟 번. 시간을 돌릴 때마다, 필연적인 불운을 맞게 된다.하린은 과연 무사히 지난 시간 속에 숨겨진 비밀을 밝혀내고 과거를 바꿀 수 있을까?',
        'http://file.koreafilm.or.kr/thm/02/99/17/56/tn_DPK018508.jpg', ' 블루버스데이'),
       ('2022-03-17', 102, '2025-01-07 11:30:43.023639', 3, NULL, 27, 2, 'dbdb1114', NULL,
        '내 인생 목표가 엔터 탈출이다!모든 열정이 식어버린 ‘15년차 아이돌 매니저’ 배재성.우연히 찾아온 꿈 같은 기회와 현금 10억을 단 하룻밤 사이에 날린다.대신, 분신 같은 아이돌 그룹 ‘벨라’를 지켜내는데!여기서 문제 한 가지.지난 밤의 활약이 전혀 기억나지 않는다는 것!이 기가 막힌 상황,재성은 사라진 기억과 돈을 쫓아 어젯밤을 되짚기 시작하는데…K-POP 아이돌을 만드는 꿈의 레시피가 지금 공개된다!',
        'http://file.koreafilm.or.kr/thm/02/99/17/59/tn_DPK018579.jpg', ' 아이돌레시피'),
       ('2020-10-08', 99, '2025-01-07 11:30:43.023639', 7, NULL, 28, 2, 'dbdb1114', NULL,
        '악의 집단이 퍼뜨린 바이러스로 폐허가 된 지구를 구하기 위해 과거, 현재, 미래에 흩어진 소년들이 만나 희망의 별을 찾아가는 이야기',
        'http://file.koreafilm.or.kr/thm/02/99/17/06/tn_DPK016311.jpg', ' 피원에이치 : 새로운 세계의 시작'),
       ('2022-07-20', 86, '2025-01-07 11:30:43.023639', 7, NULL, 29, 3, 'dbdb1114', NULL,
        '취업준비생 형우는 우연히 어떤 남자의 지갑을 찾아준다. 그런데 이 남자 이상하다.병약해 보이는 얼굴은 피투성이고, 지갑엔 엔화가 들어있다.다음날 형우가 또 발견했을 때, 건달 두 명이 이 남자를 쫓아 으슥한 곳으로 들어간다.잠시 후 다가가 보니 건달들은 피투성이가 돼서 쓰러져 있고, 의문의 남자는 흔적도 없이 사라졌다.결국 형우는 그 남자를 찾으러 가고, 상상조차 못한 세계로 한발짝씩 들어간다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/74/tn_DPK019203.jpg', ' 스파이형 모델'),
       ('2022-03-25', 98, '2025-01-07 11:30:43.023639', 10, NULL, 30, 2, 'dbdb1114', NULL,
        '엄마와의 마지막 약속을 지키고 싶었던 ‘태주’와 엄마 때문에 평생 죄책감에 시달린 ‘태성’,그 둘의 삶은 처음부터 삐걱거리기 시작했고 성서에 등장하는 야곱과 에서 쌍둥이 형제처럼 서로 미워하다 결국 서로에게 결코 지울 수 없는 상처를 주고 서로 다른 길을 간다.20년 후, 태주는 서울 강남서의 경찰로 태성은 부산 최고의 유물밀반출 범죄조직 마립칸의 후계자로 서로 다른 길을 걷게 된다. 부산에서 발생한 일본 유물밀반출 사건을 조사하던 태주는 마립칸의 2인자인 태성과 다시 만나게 된다.돈이 거룩이고 돈이 의리인 태성… 그런 태성에게도 단 하나의 소중한 사람이 있다.어릴 때부터 태성을 묵묵히 바라보는 그의 연인 찬미, 오직 찬미만을 바라보며 이 악물고 경찰로서 성공을 향해 달려왔던 태주. 그러나… 그들에게 죽도록 지키고 싶었던 충격적 진실이 밝혀진다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/66/tn_DPK018905.jpg', ' 우리들의 천국');
INSERT INTO hanghaeho.movie (open_day, running_time, create_at, genre_id, modify_at, movie_id, rating_id, create_by,
                             modify_by, plot, thumbnail, title)
VALUES ('2020-05-28', 81, '2025-01-07 11:30:43.023639', 10, NULL, 31, 2, 'dbdb1114', NULL,
        '경찰도 해결하지 못하는 미제 사건들을 의뢰 받고 직접 몸으로 나서 해결하는 전대미문의 ‘특수반’.미성년자 성매매 사건을 일망 타진한 이들은 다음 임무인 ‘알고몰’ 사건을 의뢰 받고 수사를 진행한다.늘 있는 미성년자 노동착취 사건들 중 하나로 생각했던 것도 잠시, 어두운 지하세계 그 끝에 거대한 배후가 있음을 알게 되는데… 나쁜 놈들을 때려잡는 미친 놈들이 온다!',
        'http://file.koreafilm.or.kr/thm/02/00/05/51/tn_DPK015616.jpg', ' 범죄해결 특수반'),
       ('2021-03-03', 112, '2025-01-07 11:30:43.023639', 9, NULL, 32, 3, 'dbdb1114', NULL,
        '현대 문학의 거장 ''요제프 클라인''의  미발표 원고 를 둘러싼 이스라엘 국립 도서관과 ''에바 호프''의 소송을 다룬 뮤지컬 공연실황',
        'http://file.koreafilm.or.kr/thm/02/99/17/22/tn_DPA001218.jpg', ' 아르코 라이브 뮤지컬 호프'),
       ('2021-01-21', 99, '2025-01-07 11:30:43.023639', 3, NULL, 33, 2, 'dbdb1114', NULL,
        '은서는 명절을 맞이해 예비남편 지상의 집에 방문한다. 식구들에게 인사를 마친 은서는 며느리들만 일하는 집안 분위기를 느끼고, 그때 큰며느리가 장을 보러 가자며 다른 며느리들을 봉고차에 태운다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/18/tn_DPK016728.jpg', ' 큰엄마의 미친봉고'),
       ('2022-01-01', 123, '2025-01-07 11:30:43.023639', 2, NULL, 34, 1, 'dbdb1114', NULL,
        '아내를 잃고 십 년 동안 한 글자도 못 쓴 작가 민식. 그리고 그런 그를 이용해 뭔가를 해 보려는 초등학교 동창이자 그의 에이전트 희애.어느 날 갑자가 나타나 자신이 죽은 아내가 부활한 여자라고 주장하는 보람. 그로 인해 민식은 혼란스럽지만 보람은 민식을 공격하려는 안티 팬 미애의 코를 납작하게 해 주고 민식에게 힘을 내게 해 주는데. 둘은 처음으로 서로에게 좋은 감정을 갖게 되면서 각각 한 권씩의 책을 단 하룻밤을 세워 써 내는데. 그 두 권의 책으로 인해 지구가 멸망할 위기에 처할 줄이야.아니면 이 모든 것들이 민식 머릿속에서 상상해 낸 허구의 세계일 수도. 그렇다면 불행에 절어 단순하게 글 못 쓰다가 미쳐 버린 민식에 대한 이야기일까? 세 파트로 나뉘는 영화. 보람과 민식의 이야기에 이어 두 사람이 각각 쓴 책 안의 이야기가 2,3파트에서 펼쳐진다.2편에서는 죽은 민식의 아내 현주, 안티팬 미애등이 새로 등장하고 수호천사들이 하늘에서 내려오고 신도 등장한다.3편에서는 보람이 일하던 슈퍼 사장과 희애의 남편인 출판사 사장 용인이 슈퍼 사장 애인인 숙희를 사이에 두고 싸우는데.사람의 몸을 옮겨 다니는 외계인이 난데없이 등장하고 이야기는 걷잡을 수 없이 흐른다.그리고 모든 비밀들이 4파트에서 해결된다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/58/tn_DPK018544.jpg', ' 존재한다, 존재하지 않는다'),
       ('2022-01-01', 112, '2025-01-07 11:30:43.023639', 3, NULL, 35, 2, 'dbdb1114', NULL,
        '‘살아가기’ 보다 ‘살아내기’로 하루하루가 고단한 스물다섯 살 청년 ‘청단’.우연히 알게 된 천 살 먹은 회화나무 정령 ‘혼’ 덕에 자신을 사랑하는 ‘살아오름’의 시간을 만난다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/59/tn_DPK018616.jpg', ' 살아오름: 천년의 동행'),
       ('2023-09-20', 97, '2025-01-07 11:30:43.023639', 8, NULL, 36, 3, 'dbdb1114', NULL,
        '유일한 가족인 할머니의 집을 철거해야 한다는 전화를 받고 마지못해 통영에 있는 할머니의 병원을 찾은 ‘수연’.7년 만에 만난 ‘수연’과 할머니 ‘영순’은 오래전 실종된 엄마 ‘경미’를 둘러싸고 서로를 경멸하며 물어뜯는다.할머니가 엄마를 지옥같이 못살게 굴었고 급기야 방에 가뒀다고 말하는 ‘수연’과 괴물 같은 ‘수연’을 낳고 딸이 미쳤으며 온 동네에 자신을 모함했다는 할머니 ‘영순’.애써 상실의 아픔을 외면해왔던 ‘수연’은 할머니가 쓴 소설과 엄마의 찢긴 일기장을 찾으면서 잊힌 과거와 마주하고, 서로 불운하게 얽혔지만 헤어 나올 수 없는 ‘경미의 세계’에 부딪히게 되는데…“내가 널 망쳤을까, 네가 날 망쳤을까. 어떤 이야기가 네 마음에 드니?”',
        'http://file.koreafilm.or.kr/thm/02/99/18/17/tn_DPK021109.jpg', ' 경미의 세계'),
       ('2021-01-14', 111, '2025-01-07 11:30:43.023639', 2, NULL, 37, 2, 'dbdb1114', NULL,
        '저는 웃긴 게 아닙니다.귀여운 겁니다.어린이 코딩 교육 영업소장 ‘기성’은 사고뭉치인 아버지, 어디로 튈 지 모르는 사춘기 딸, 동창과 재혼한 전 부인이 있는 ‘콩가루 집안’의 가장이다.그런 그의 유일한 꿈은 아내와 다시 합쳐 가족들과 함께 넓은 아파트에 사는 것. 소심남 ‘기성’을 귀엽다고 하는 은행 직원 ‘일영’으로 인해 그의 삶은 조금씩 뒤바뀌고, 어쩌면 ‘기성’은 가족을 다시 되찾을 수 있을 것만 같다.‘전 방이 네 개 있는 아파트로 들어갈 거예요”찌질하지만 볼매, ‘귀여운 남자’의 가족 봉합 프로젝트가 시작된다!',
        'http://file.koreafilm.or.kr/thm/02/99/17/14/tn_DPK016615.jpg', ' 귀여운 남자'),
       ('2021-12-08', 97, '2025-01-07 11:30:43.023639', 2, NULL, 38, 3, 'dbdb1114', NULL,
        '기억을 잃은 여자와 모든 것을 기억하는 남자의 사랑을 그린 로맨스 영화', 'http://file.koreafilm.or.kr/thm/02/99/17/54/tn_DPK018457.jpg',
        ' 기억의 시간'),
       ('2021-10-14', 108, '2025-01-07 11:30:43.023639', 2, NULL, 39, 3, 'dbdb1114', NULL,
        '오점 없는 완벽한 인생에 ‘은밀한 비밀’이 생겨버렸다!?여자친구 ‘지연’과 결혼을 앞둔 완벽남 ‘완준’‘완준’은 사고뭉치 선배로부터 받은 부탁으로 ‘지연’에게도 말 못 할 은밀한 비밀을 갖게 된다.어느 날, ‘완준’은 자신을 짝사랑하는 직장동료 ‘예리’에게 이 사실을 들키게 되고, 그녀와 뜻밖의 계약을 맺게 되는데…갑자기 꼬여버린 인생!무사히 결혼에 골인할 수 있을까?!',
        'http://file.koreafilm.or.kr/thm/02/99/17/43/tn_DPK017881.jpg', ' 색다른 그녀'),
       ('2022-01-01', 96, '2025-01-07 11:30:43.023639', 10, NULL, 40, 3, 'dbdb1114', NULL,
        '온라인 도박판에서 일명 ‘타짜’로 불리던 ‘택동’이 복수를 위해 현실 도박판에 뛰어들며 벌어지는 이야기를 그린 범죄 액션 영화.',
        'http://file.koreafilm.or.kr/thm/02/99/18/06/tn_DPK020577.jpg', ' 타짜 전설의 땁');
INSERT INTO hanghaeho.movie (open_day, running_time, create_at, genre_id, modify_at, movie_id, rating_id, create_by,
                             modify_by, plot, thumbnail, title)
VALUES ('2022-08-17', 112, '2025-01-07 11:30:43.023639', 2, NULL, 41, 4, 'dbdb1114', NULL,
        'KS상사 오너의 딸이던 어린 시절의 ''정세리''는 여자의 자살을 목격하게 되고 그 후로 귀신을 볼 수 있게 된다.2021년 현재. 정세리는 카페에서 일을 하며 살고 있다.여전히 귀신을 보는 그녀는 밤마다 자신에게 찾아오는 귀신들 때문에 밤에 잠을 잘 이루지 못한다.그녀는 주변 사람들에게 피해를 주고 싶지 않아 친구도 없다. 유일한 친구는 카페사장 ''황은혜'' 뿐이다.정세리에게 찾아오는 귀신은 주로 밤에 찾아오는 ''악령''과 낮에 찾아오는 ''일반귀신'' 의 두 종류이다.귀신들은 처음에는 자신이 죽은 지 모르는 것이 일반적이며 그들이 자신이 죽은 것을 인지한 후에는 이승에서 이루고 싶은 소망이 있어이승에 남아있다. 그래서 정세리는 가끔 그들이 하고 싶은 것들을 조용히 도와주기도 한다.카페에는 죽돌이 귀신 3인방이 있다. 그들은 아줌마1, 아가씨1, 청년1 이렇게 3명으로 인탄이 자신들을 볼 수 있다는 사실을 알고는계속 자신들을 어필한다.어느 날 정세리 앞에 귀신 송지찬이 나타난다. 그 역시 자신이 귀신이라는 것을 알지 못한다.게다가 그는 자신의 과거를 전혀 기억하지 못한다.송지찬은 자신의 말을 알아듣는 정세리에게 계속 자신을 도와달라고 요구한다.이런 지찬을 자신으로부터 떨어뜨리기 위해 그를 도와주기로 하는 정세리. 지찬의 기억을 찾기 위해 정세리와지찬은 그의 행적을 추적해 나간다. 그 과정에서 알게되는 지찬의 죽음에 대한 진실.괴로워 하는 지찬과 그를 위로하는 정세리 사이에서 싹트는 사랑의 감정…',
        'http://file.koreafilm.or.kr/thm/02/99/17/78/tn_DPK019381.jpg', ' 오싹한 동거'),
       ('2022-06-29', 124, '2025-01-07 11:30:43.023639', 6, NULL, 42, 3, 'dbdb1114', NULL,
        '이 다큐 영화는 대한민국 제18대 대통령이자 최초의 여성 대통령 박근혜의 탄핵과 형사재판의 불법, 부당성을 기록하는 작품이다. 박근혜 대통령 탄핵 및 형사사건의 변호인단, 법대 교수, 정치학 교수들의 인터뷰와 사건 현장에 대한 촬영을 근거로 화면을 구성하였다.탄핵사건의 도화선으로 작용한 투기자본감시센터 고발장의 진실은 검찰수사기록을 통해, JTBC의 태블릿PC보도는 국립과학수사연구원의 포렌식 결과물을 통해 규명했다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/71/tn_DPA001593.jpg', ' 위대한 침묵'),
       ('2021-12-30', 104, '2025-01-07 11:30:43.023639', 3, NULL, 43, 3, 'dbdb1114', NULL,
        '오늘도 배우들은 연기를 위해 고군분투한다. 옥상에선 내가 톱스타!   Ok, 탑스타 녹색창에 떠야만 배우인가요?  31, 내리다 감독님, 제 메일은 언제 확인하실까요?  오디션 아기에게 분유를 먹이는 나는 연기가 고프다  언젠간 터질 거야 오디션, 아빠가 없어도 잘 할 수 있어  클라운  이들은 그토록 바라던 연기의 꿈을 펼칠 수 있을까?',
        'http://file.koreafilm.or.kr/thm/02/99/17/55/tn_DPK018465.jpg', ' 숏버스 배우행'),
       ('2021-10-28', 87, '2025-01-07 11:30:43.023639', 4, NULL, 44, 4, 'dbdb1114', NULL,
        '심장을 움켜쥐는 의심의 서막. 그림자 드리운 마음 한 켠, 숨어있던 또 다른 나를 만난다.지옥에 가지 않기 위한 기도  신에게 보내는 편지 옥죄어오는 무거운 시선  그랑주떼 흔들리는 믿음과 현실 사이 악몽  망치 임신과 함께 찾아온 알 수 없는 불안  사마귀  등골 서늘한 상상... 언제쯤 멈출 수 있을까? 네 편의 섬뜩한 악몽 속으로 초대합니다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/45/tn_DPK017935.jpg', ' 숏버스 섬뜩행'),
       ('2021-11-25', 90, '2025-01-07 11:30:43.023639', 7, NULL, 45, 3, 'dbdb1114', NULL,
        ' 장래희몽  어떤 일 하세요?  라는 질문에 어떻게 대답해야 할지 항상 고민이다. 그저 꿈을 쫓아 살았는데 하고 싶고 되고 싶은게 참 많았던 것 같다. 초겨울 입시 과외를 하며 살아가는 영화과 졸업생 현준. 30살이 되니 현실이 막막하기만 하다. 소영의 영화 오랜만에 영화 현장에 간 휴학생 소영. 막가파 감독과 당돌한 후배를 보고 말문이 막힌다. 과연 오늘 하루 잘 넘길 수 있을까? 애로 에로 영화를 연출하는 영수, 그의 에로영화 촬영장에 그의 딸 수애가 갑자기 나타난다. 메이킹 필름 어쩔 수 없이 친할아버지와 영화를 찍게 된 준. 준은 할아버지를 주연 자리를 앉힌 것을 후회한다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/51/tn_DPK018309.jpg', ' 숏버스 감독행'),
       ('2021-08-19', 93, '2025-01-07 11:30:43.023639', 3, NULL, 46, 4, 'dbdb1114', NULL,
        ' 결정적 순간  연출 강인석죽은 오빠의 흔적을 찾아 프랑스 중부도시 ‘뚜르’로 향한 소영. 오빠는 어떤 삶을 살았던 걸까? 셰익스피어 앤 컴퍼니  연출 안다훈서울에서 편의점 알바를 하는 미화는 파리에 사는 영빈과 통화하며 파리의 거리를 거니는 로망을 꿈꾼다. 우리는 사랑 아니면 여행이겠지  연출 박경진여행을 떠난 정아. 그곳에서 만난 성현과 음악 작업을 이어가는데, 어쩐지 세상을 떠난 전 남자친구가 계속 떠오른다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/37/tn_DPK017447.jpg', ' 숏버스 감성행'),
       ('2020-06-25', 90, '2025-01-07 11:30:43.023639', 10, NULL, 47, 2, 'dbdb1114', NULL,
        '싸움으로 이름을 날리던 길거리 파이터 ‘상구’ 는 점차 자신보다 강한 상대가 없다는 것을 알고 싸움에 싫증을 느낀다. 그러던 중 친구 ‘문재’가 어머니 가게에서 ‘민국’ 패거리들과 시비가 붙고 일방적으로 맞게 된다.상구는 친구의 복수와 더불어 더 강한 상대들을 찾아 ‘설한’ 으로 전학을 가기로 한다. ‘설한’은 국내 유일의 격투 특성화 학교이며 매년 리그 우승자는 로드FC로 영입 된다. 상구는 강해지기 위해 각기 다른 격투기 종목의 상대들과 싸우게 되고, 각 격투 종목의 장점을 터득하여 최종전까지 가게 되는데..',
        'http://file.koreafilm.or.kr/thm/02/00/05/59/tn_DPK015898.jpg', ' 전설의 파이터'),
       ('2022-05-26', 107, '2025-01-07 11:30:43.023639', 3, NULL, 48, 1, 'dbdb1114', NULL,
        '한국 최초의 여성 영화감독 박남옥의 생을 노래하다!국립극장  명색이 아프레걸 은 영화 ‘미망인’(1955)을 연출한 한국 최초의 여성 영화감독 박남옥을 주인공으로 한 작품이다. ‘아프레걸(après-girl)’은 한국전쟁 이후 새롭게 등장한 여성상을 일컫는 당대 신조어로 봉건적 사회 구조와 관습에 얽매이지 않고 사회 안에서 자신의 주체적 역할을 찾은 여성을 지칭한다. 주인공 박남옥은 일제강점기부터 6·25전쟁까지 격동의 시절을 살아오며 전통적인 여성상에 도전한 대표적인 인물이다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/70/tn_DPA001584.jpg', ' 명색이 아프레걸'),
       ('2020-05-20', 122, '2025-01-07 11:30:43.023639', 3, NULL, 49, 2, 'dbdb1114', NULL,
        '하는 일마다 꼬이는 미남가족과 하는 일마다 운수 대통인 추남가족이 서로 엮이게 되는 과정을 그린 블랙코미디',
        'http://file.koreafilm.or.kr/thm/02/99/17/22/tn_DPK016867.jpg', ' 머피와 샐리의 법칙'),
       ('2021-10-14', 99, '2025-01-07 11:30:43.023639', 8, NULL, 50, 2, 'dbdb1114', NULL,
        '가족 뒷바라지에 지친 경숙을 지탱해주는 버팀목은 ´주님´ 뿐이다. 맹목적 신앙심을 가진 경숙으로 인해 가족은 늘 갈등한다. 백수 남편과 삼촌, 군생활에 적응 못한 아들, 반항적인 딸, 이 아슬아슬한 가족의 내일은 무사할까?',
        'http://file.koreafilm.or.kr/thm/02/99/17/44/tn_DPK017926.jpg', ' 그녀의 가족은 잘못이 없어');
INSERT INTO hanghaeho.movie (open_day, running_time, create_at, genre_id, modify_at, movie_id, rating_id, create_by,
                             modify_by, plot, thumbnail, title)
VALUES ('2021-02-17', 107, '2025-01-07 11:30:43.023639', 9, NULL, 51, 1, 'dbdb1114', NULL,
        '태양이 지구의 주위를 돌고 있다고 믿고 있는 1598년.수학자이자 이탈리아의 대학교수인 갈릴레오는 독일의 수학자 케플러에게 ‘우주의 신비’라는 책과 함께 우주에 대한 연구를 제안 받는다.갈릴레오는 단번에 거절하지만 끈질긴 케플러의 설득에 그의 가설이 틀린 것을 증명하기 위한 연구를 하던 중 언급조차 금기 시 되던 지동설을 대입한다면 이 황당한 가설이 맞을 수도 있다는 답을 내리게 되는데…',
        'http://file.koreafilm.or.kr/thm/02/99/17/20/tn_DPA001206.jpg', ' 아르코 라이브 뮤지컬 시데레우스'),
       ('2020-03-25', 118, '2025-01-07 11:30:43.023639', 9, NULL, 52, 1, 'dbdb1114', NULL,
        '배타적인 마을 사람들에게서 마녀로 불리며 고물로 뒤덮인 숲속 오두막 안테모사에 사는 세 여자와 안테모사를 철거하려는 시장, 마을사람들의 갈등과 화해를 그린 뮤지컬 공연실황 영상',
        'http://file.koreafilm.or.kr/thm/02/00/05/50/tn_DPA001066.jpg', ' 아르코 라이브_뮤지컬 안테모사'),
       ('2022-05-06', 111, '2025-01-07 11:30:43.023639', 3, NULL, 53, 3, 'dbdb1114', NULL,
        '시나리오 작가가 과거와 현재를 넘나드는 시간여행을 통해 조선최고의 부자 최준의 나눔정신을 추적하는 영화',
        'http://file.koreafilm.or.kr/thm/02/99/18/28/tn_DPK021531.jpg', ' 마지막 부자 최준'),
       ('2022-02-18', 94, '2025-01-07 11:30:43.023639', 2, NULL, 54, 3, 'dbdb1114', NULL,
        '유명한 시나리오 작가 이글은 슬픈 로맨스 극을 집필하기 시작한다. 중후한 남성과 여성의 ‘슬프지만 아름다운 사랑 이야기.’ 어느 날, 작가가 자신의 시나리오에 대해 동료들과 회의하는 중, 동료들의 억지 미팅으로 신인 남자 배우 백지인을 만나게 된다. 서로의 첫인상에서 호감을 받은 이글과 지인은 이후 연인 관계가 된다. 작가는 시나리오에 대해 지인과 의논을 하는 나날이 많아지며 일과 삶을 공유하는 관계로 사랑의 형태가 발전해 나아간다. 지인을 사랑하는 마음이 깊어질수록, 시나리오 속 남성의 모습이 자신의 연인의 모습으로 변해가는 것을 느끼는 이글. 그러던 어느 날. 이글은 불현듯 글 속의 남자주인공과 지인이 비슷한 모습을 품고 있다는 생각이 든다. ‘슬프지만 아름다운 사랑 이야기.’ 싸한 감정을 느끼는 이글은 지인을 지켜보게 되는데. 시나리오 속 남성처럼 영츠하이머의 증세를 보이는 지인. 충격을 받은 이글은 지인의 증세가 더욱 심해지기 전 그의 꿈을 이뤄주기 위해 글을 쓴다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/66/tn_DPK018904.jpg', ' 당신은 이 글 속에 살아있다'),
       ('2021-11-04', 360, '2025-01-07 11:30:43.023639', 4, NULL, 55, 2, 'dbdb1114', NULL,
        '''Dr.브레인''은 타인의 뇌에 접속해 기억을 읽는 뇌동기화 기술에 강박적으로 집착하는 천재 뇌과학자의 이야기다. 미스터리한 사고로 가족이 희생되는 비극을 겪은 이후 신기술을 이용하여 사건 관계자들의 뇌에 접속해 진실의 파편을 파헤치기 시작한다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/45/tn_DPK017940.jpg', ' Dr. 브레인'),
       ('2021-01-01', 101, '2025-01-07 11:30:43.023639', 3, NULL, 56, 2, 'dbdb1114', NULL,
        '2004년 미국 이라크 전쟁 중, 복음 선교하러 이라크 팔루자 현지에서 체포, 억류되었다가 구사일생 다섯 번 생환되었던 선교사 목사의 놀라운 구세주 실화!',
        'http://file.koreafilm.or.kr/thm/02/99/18/52/tn_DPK022563.jpg', ' 아가페 : 분노와 사랑'),
       ('2021-12-29', 86, '2025-01-07 11:30:43.023639', 3, NULL, 57, 3, 'dbdb1114', NULL,
        '남편의 실종, 그리고 벌어지는 이상한 사건들기억하고 있는 것이 모두 사실은 아니다!수연은 남편 ‘영민’이 실종된 뒤 계속해서 이상한 일이 일어나자 정신과 의사 정우에게 상담을 받는다.정우는 남편과의 기억이 혼미한 수연을 위해 남편과 처음 만났던 장소를 방문하라는 충고와 함께 그 장소를 방문한다.그곳에서 죽은 남편 영민의 시체를 발견하자 갑자기 태도가 돌변하는 수연.한편 보험 조사원으로부터 수연은 지금까지 결혼했던 남자들이 모두 죽고 막대한 보험금을 받아왔다는 사실을 알게 된 정우.그때 정우에게 산속 외딴 저택에서 둘만의 파티에 초대를 하는 수연정우는 그곳에서 충격적이고 참혹한 진실을 맞이하게 되는데....',
        'http://file.koreafilm.or.kr/thm/02/99/17/54/tn_DPK018458.jpg', ' 메모리: 조작살인'),
       ('2020-08-19', 99, '2025-01-07 11:30:43.023639', 2, NULL, 58, 3, 'dbdb1114', NULL,
        '“이 영감하고 무슨 일이 생기겠구나” 30년 전 남편을 잃고 혼자 세 딸을 키워 모두 출가시키고 홀로 살아온 이점순. 어느 날 그녀의 집에 국밥집을 운영할 때 친분이 있던 사내 박동만이 불쑥 찾아온다. 박동만 역시 일찍이 부인과 사별하고 두 아들의 무관심 속에 외롭게 살아가던 처지. 예전부터 이점순에게 마음이 있었던 박동만은 작정을 하고 그녀를 찾아와 옥신각신 흥정 끝에 셋방살이를 시작한다. 홀로 자식들 키우느라 거칠어진 여인과 홀아비로 사느라 능청스러워진 사내, 달라도 너무 다른 두 사람의 동거. 황혼녘에 불어온 봄바람인줄 알았더니, 이점순과 박동만은 어느새 함께 여름을 맞고 가을을 거닐고 겨울을 기다리게 되는데…    2020년 8월 19일, 늙은 부부의 눈부신 끝사랑이 세상을 비춘다',
        'http://file.koreafilm.or.kr/thm/02/99/17/02/tn_DPA001109.jpg', ' 늙은 부부이야기: 스테이지 무비'),
       ('2020-05-28', 100, '2025-01-07 11:30:43.023639', 3, NULL, 59, 4, 'dbdb1114', NULL,
        '갱년기를 겪으며 갑상선 암에 걸려 힘들게 살아가는 퇴폐마사지업소의 경숙. 보고 싶었던 딸의 결혼 소식을 들은 경숙은, 도박으로 자신의 인생을 망치고 가정을 파탄시킨, 다시는 보고 싶지 않은 남편 유병호를 찾으러 강원도 태백으로 간다. 거친 눈보라를 헤치며 찾아다니지만 그 어디에도 남편은 없는데... 갑자기 복받쳐 오는 서러움과 분노가 그녀의 가슴과 머리를 어지럽힌다.',
        'http://file.koreafilm.or.kr/thm/02/00/05/56/tn_DPK015772.jpg', ' 좋은 여자'),
       ('2021-10-28', 93, '2025-01-07 11:30:43.023639', 3, NULL, 60, 3, 'dbdb1114', NULL,
        '2019년, OECD 국가 중 최고의 대학진학률을 자랑하는 대한민국!그곳에서도 엘리트만 모인다는 주한미군배속한국군, 카투사.그들 사이에 우리의 주인공 추해진의 학력은... 고졸!결국 해진은 헬조선을 탈출하고자 미군을 준비한다. 큰일 났습니다. 마음의 편지가 웬 말입니까? 미군입대를 눈앞에 둔 말년병장 추해진은 느닷없는 절도사건에 휘말린다.누명을 벗기 위해선 동료들의 서명을 받아야 하는데...동료들과 출신, 성분, 배경 모두 다른 해진은 과연 미군이 될 수 있을까?',
        'http://file.koreafilm.or.kr/thm/02/99/17/42/tn_DPK017853.jpg', ' 가치 캅시다');
INSERT INTO hanghaeho.movie (open_day, running_time, create_at, genre_id, modify_at, movie_id, rating_id, create_by,
                             modify_by, plot, thumbnail, title)
VALUES ('2020-09-24', 81, '2025-01-07 11:30:43.023639', 3, NULL, 61, 2, 'dbdb1114', NULL,
        '“평소와 똑같은 하루, 하지만 유난히 마음 울적한 그런 날이 있다.”새벽녘 카페 안, 무표정한 카페 사장 연우, 넉살 좋은 작가 성준, 젊은 감독 산수가 희망 가득한 미래를 꿈꾸며 불투명한 이야기를 나눈다.안개 낀 어느 날, 숲속에서 우연히 만난 심희, 영노, 광철. 꿈일지도 모르는 하루를 보내며 각자의 꿈에 대해 묻는다.비 오는 어느 날, 은행에서 마주친 헤어진 연인 인규와 나연. 최악의 순간이지만 그녀에게 부탁을 해야만 한다. 평범한 하루를 살아가고 있는 청춘들이 전하는너무 가깝지도, 멀지도 않은 원마일 위로!',
        'http://file.koreafilm.or.kr/thm/02/99/17/05/tn_DPK016294.jpg', ' 마음 울적한 날엔'),
       ('2020-05-07', 104, '2025-01-07 11:30:43.023639', 3, NULL, 62, 4, 'dbdb1114', NULL,
        '죽도의 12살 소녀 서퍼 비주, 파도가 있는 날은 모든 것을 내팽개치고 서핑을 하는 그곳 서퍼 중에 하나다. 비주 눈에는 서퍼가 아닌 수정과 정용이 더 눈에 띈다. 결국 두 사람도 서핑을 만나게 되고 한편 서핑 핫 플레이스로 떠오른 죽도 해변은 그 열기로 몸살을 앓게 된다. 파도가 넘실거리 듯 시간은 흘러가고 결국 비주도 그곳을 떠날 운명에 처하게 되는데...',
        'http://file.koreafilm.or.kr/thm/02/00/05/56/tn_DPK015763.jpg', ' 죽도 서핑 다이어리'),
       ('2021-12-09', 102, '2025-01-07 11:30:43.023639', 3, NULL, 63, 3, 'dbdb1114', NULL,
        ' 총을 들지 않는 사람들  이후 15년이 흘렀다. 2002년부터 시작된 관심은, 보수정권 10년여를 거쳐 2018년 헌법재판소의 대체복무제도가 결정되기까지 그들과 함께했다. 자신의 존재를 증명하고 사회에 울림을 준 시간들. 양심적 병역거부 운동이 걸어온 “평화의 발자취”, “금기에 도전”한 시간 속으로 들어가 본다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/50/tn_DPA001470.jpg', ' 총을 들지 않는 사람들: 금기에 도전'),
       ('2021-01-01', 85, '2025-01-07 11:30:43.023639', 4, NULL, 64, 1, 'dbdb1114', NULL,
        '저마다의 은밀한 목적을 가지고 캠핑장을 찾은 젊은 남녀 커플들...... 그런데 우거진 숲속에서 미친 사내가 불쑥 튀어나와 도축용 칼을 휘두르며 그들을 위협한다. 숲속 광인(狂人)의 난도질을 피해 늦은 밤 검은 산 속에 고립된 커플들..... 공포에 질려 우왕좌왕하고 있는 그들에게 수상한 사내들이 접근하는데...... ‘익숙한 악마가 모르는 악마보다 낫다! 이제 본격적인 핏빛 공포를 경험하게 해줄게!',
        'http://file.koreafilm.or.kr/thm/02/99/17/57/tn_DPK018513.jpg', ' 창애: 짐승 잡는 덫'),
       ('2021-08-01', 90, '2025-01-07 11:30:43.023639', 2, NULL, 65, 4, 'dbdb1114', NULL,
        '빚쟁이들에게 쫓기며 근근이 자가용 택시 영업을 하며 살아가는 젊은 남자(김진엽). 아버지의 장례식장에서 방금 뛰쳐나온 젊은 여자(이설). 생면부지 관계인 두 사람의 우연한 동행의 여정이  청산, 유수 의 내용이다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/13/tn_DPK016603.jpg', ' 청산, 유수'),
       ('2021-01-01', 88, '2025-01-07 11:30:43.023639', 6, NULL, 66, 1, 'dbdb1114', NULL,
        '현 정부의 정치적 행로를 비판하는 두 여성 감독의 개인적 견해를 담은 다큐멘터리 영화',
        'http://file.koreafilm.or.kr/thm/02/99/18/05/tn_DPA001740.jpg', ' 한 번도 경험해보지 못한 나라'),
       ('2020-04-09', 81, '2025-01-07 11:30:43.023639', 10, NULL, 67, 3, 'dbdb1114', NULL,
        '“스파링 1분에 만원!”매일 같은 일상에 지친 ‘정만’은 돈 벌 궁리를 하던 중 돈과 맷집을 맞바꾸는 ‘인간 샌드백’ 알바 아이디어를 낸다.그날부터 까칠한 놈 ‘휘’, 최강 맷집 ‘민규’는 팀이 되어 글러브 하나만을 손에 낀 채 길 위로 나선다.하지만 일탈도 잠시, 돈도 본능도 쉽게 만족되지 않고 피 끓는 파이터들의 갈증은 더욱 깊어져만 가는데…어느 날 이들의 앞에 나타난 미스터리한 동창 ''유영''은 무려 세 배로 수익을 올려 주겠다는 파격적인 제안을 하고 이들은 비밀리에 운영중인 격투 도박판에 발을 들이게 된다.길거리 대신 짜릿한 격투 도박판에 뛰어든 갱생불가 꼴통들, 배팅이 시작되는 순간, 더 이상 빠꾸는 없다!',
        'http://file.koreafilm.or.kr/thm/02/00/05/51/tn_DPK015583.jpg', ' 꼴통 2인조'),
       ('2020-04-21', 108, '2025-01-07 11:30:43.023639', 3, NULL, 68, 1, 'dbdb1114', NULL,
        '병에 걸린 남해 용왕을 두고 자라와 토끼의 지혜를 겨루는 이야기인 판소리  수궁가  공연을 담은 영화',
        'http://file.koreafilm.or.kr/thm/02/00/05/50/tn_DPA001065.jpg', ' 아르코 라이브_완창판소리프로젝트2 강산제 수궁가'),
       ('2021-05-13', 111, '2025-01-07 11:30:43.023639', 4, NULL, 69, 3, 'dbdb1114', NULL,
        '“돈이 깡패다”교도소 내 권력의 양대 산맥 폭력방 VS 취사방유일하게 무기를 소유할 수 있는 취사반장은 숨은 실세로 추앙받으며 폭력방의 범털에게 항상 불만을 품게 되고, 그로 인해 감빵 안에는 극도의 긴장감이 맴돈다.그러던 중, 취사반장의 과거 악연 ‘기철’이 폭력방으로 입소하고, 본격적으로 두 방 사이 팽팽한 대립이 시작된다.교도소를 움직이는 재벌 회장과 보안과장까지 개입된 더욱 거대해진 판 속, 진정한 범털을 가리기 위한 싸움으로 크게 번져가는데….5월, 판은 이미 벌어졌다!',
        'http://file.koreafilm.or.kr/thm/02/99/17/26/tn_DPK016974.jpg', ' 범털 2: 쩐의 전쟁'),
       ('2021-01-21', 97, '2025-01-07 11:30:43.023639', 3, NULL, 70, 4, 'dbdb1114', NULL,
        '''가족''이란 무엇일까? “집에서는 티격태격 밖에서는 남남처럼”, 아빠와 아들“진짜 엄마 김치 맛이 나”, 김장 날 모인 세 남매“머리 좀만 다듬자”, 아들과 아빠 그리고 아빠의 애인“이야기를 보는 우리만의 방법이 있어”, 엄마와 아들모습은 달라도 마음이 꼭 닮아 있는 New 노멀 패밀리!',
        'http://file.koreafilm.or.kr/thm/02/99/17/16/tn_DPK016697.jpg', ' 오늘, 우리2');
INSERT INTO hanghaeho.movie (open_day, running_time, create_at, genre_id, modify_at, movie_id, rating_id, create_by,
                             modify_by, plot, thumbnail, title)
VALUES ('2021-05-13', 144, '2025-01-07 11:30:43.023639', 9, NULL, 71, 3, 'dbdb1114', NULL,
        '‘시조’가 국가의 이념인 상상 속의 ‘조선’삶의 고단함과 역경을 시조 속에 담아 훌훌 털어버렸던 백성들은 역모 사건으로 시조 활동이 금지되면서 자유도 행복도 잊은 채 살아간다.그러던 중 15년 만에 누구나 참여할 수 있는 조선시조자랑이 열리게 되고, 탈 속에 정체를 감추고 양반들의 악행을 파헤쳐 행복한 세상을 만들고자 조직된 비밀시조단 ‘골빈당’은 이것을 기회 삼아 조선에 새로운 바람을 불러일으키고자 한다.한편, 왕의 비선실세이자 시조대판서인 홍국은 자신에 대한 악덕한 소문을 퍼트리고 다닌다는 이유를 들어 골빈당을 잡으려는 음모를 꾸미는데…',
        'http://file.koreafilm.or.kr/thm/02/99/17/29/tn_DPA001294.jpg', ' 2021 스웨그 에이지 : 외쳐, 조선!'),
       ('2021-06-16', 103, '2025-01-07 11:30:43.023639', 3, NULL, 72, 2, 'dbdb1114', NULL,
        '예술대 영화과 연출 전공 4학년 ‘겨레’는 하루 아침에 정성을 다해 쏟은 졸업 영화 시나리오를 전 남자친구이자 졸업한 학과 선배 ‘현수’에게 스틸 당한다.망연자실하던 겨레는 급히 다른 시나리오로 준비하기에 이른다. 완벽하지 않은 졸업영화 팀원들이 모여 그들의 성장과 사랑을 담은 이야기다.',
        'http://file.koreafilm.or.kr/thm/02/99/17/32/tn_DPK017196.jpg', ' B급 청춘'),
       ('2021-01-01', 112, '2025-01-07 11:30:43.023639', 3, NULL, 73, 5, 'dbdb1114', NULL,
        '탈영병들을 잡는 군무 이탈 체포조(D.P.) 준호와 호열이 다양한 사연을 가진 이들을 쫓으며 미처 알지 못했던 현실을 마주하는 이야기',
        'http://file.koreafilm.or.kr/thm/02/99/17/42/tn_DPK017858.jpg', ' D.P.'),
       ('2022-04-14', 105, '2025-01-07 11:30:43.023639', 2, NULL, 74, 4, 'dbdb1114', NULL,
        '“시간이 멈춰도 괜찮아. 지금 너와 함께 라면”명문 신하고등학교에는 3교시와 4교시 사이에 비밀이 한가지 숨겨져 있다.바로 시간이 10배 느리게 흐르고, 10분이 100분이 되는 3.5교시가 존재한다는 것!백아진(조아)은 3.5교시에 우연히 들어가고 그곳에 갇혀 있던 남학생 강다원(임지섭)을 만난다.다원을 3.5교시로부터 탈출시키기 위해 아진은 그 곳에 숨겨진 미스테리를 풀어나간다.그러나 이를 방해하는 자들이 학교에 존재하고 3.5교시를 숨기려고 애쓰는데…과연 신하고의 3.5교시에는 어떤 비밀이 숨겨져 있는 것일까?다원은 3.5교시를 무사히 탈출해 아진을 만날 수 있을까?',
        'http://file.koreafilm.or.kr/thm/02/99/17/66/tn_DPK018912.jpg', ' 3.5교시'),
       ('2020-09-02', 89, '2025-01-07 11:30:43.023639', 2, NULL, 75, 4, 'dbdb1114', NULL,
        ' 유레카! 영화감독을 꿈꾸던 ‘현수''의 과거.‘현수’는 우연히 만난 ‘미주’에게 주인공을 제안하고, 함께 촬영하며 연인으로 발전한다. 뭐라도 하고 있는 거야? 지칠 대로 지친 ''미주''의 현재.부족한 생활비, 팀장의 막말… 매일이 힘든 ‘미주’는 여전히 꿈만 꾸는 ''현수''가 답답하기만 하다.사소한 한 마디에 크게 다툰 다음 날, 두 사람에게 같은 날이지만 전혀 다른 7월 7일이 시작되는데…과연 하루의 끝에 기다리고 있는 엔딩은 무엇일까?우리는 다시 예전처럼 돌아갈 수 있을까?',
        'http://file.koreafilm.or.kr/thm/02/99/17/03/tn_DPK016199.jpg', ' 7월7일'),
       ('2021-01-01', 99, '2025-01-07 11:30:43.023639', 3, NULL, 76, 2, 'dbdb1114', NULL,
        '단군왕검을 모시고 사는 집안에 주인공 ‘강단’이 학교생활에서 일진들의 시중들며 지내다 일진들의 폭력을 극복하고 여자 친구를 구하는 내용의 극영화',
        'http://file.koreafilm.or.kr/thm/02/99/17/70/tn_DPK019056.jpg', ' 단''ㅅ 패밀리 남바완'),
       ('2025-01-08', 103, '2025-01-07 11:30:43.023639', 2, NULL, 77, 1, 'dbdb1114', NULL,
        '“연주할 때만 느껴지는 감정이 있거든. 그게 널 만나면 느껴져”유학 중이던 피아니스트 유준은 팔목 치료를 위해 한국에 교환 학생으로 오게 된다.학교에 처음 간 그날, 신비로운 피아노 선율에 이끌려 도착한 연습실에서 유준은 정아와 마주치고, 운명처럼 끌린 두 사람은 시간을 보내며 가까워진다.하지만, 연락처조차 알려주지 않는 정아와의 만남은 계속 엇갈리고, 유준의 시선이 늘 자신을 향해 있다고 생각한 인희의 갑작스러운 고백은 정아에게 큰 상처를 입힌다.그날 이후 사라진 정아의 행방을 찾던 유준은 정아의 비밀을 마주하게 되는데…“너와 나의 시간을 이어 준 연주곡 ‘시크릿’그렇게 마법 같은 사랑은 시작된 거야”',
        'http://file.koreafilm.or.kr/thm/02/99/18/69/tn_DPK023238.jpg', ' 말할 수 없는 비밀');


INSERT INTO hanghaeho.screen (create_at, modify_at, screen_id, create_by, modify_by, name)
VALUES ('2025-01-08 20:51:55.447763', NULL, 1, 'system', NULL, 'Screen 1'),
       ('2025-01-08 20:51:55.447763', NULL, 2, 'system', NULL, 'Screen 2'),
       ('2025-01-08 20:51:55.447763', NULL, 3, 'system', NULL, 'Screen 3'),
       ('2025-01-08 20:51:55.447763', NULL, 4, 'system', NULL, 'Screen 4'),
       ('2025-01-08 20:51:55.447763', NULL, 5, 'system', NULL, 'Screen 5'),
       ('2025-01-08 20:51:55.447763', NULL, 6, 'system', NULL, 'Screen 6'),
       ('2025-01-08 20:51:55.447763', NULL, 7, 'system', NULL, 'Screen 7'),
       ('2025-01-08 20:51:55.447763', NULL, 8, 'system', NULL, 'Screen 8'),
       ('2025-01-08 20:51:55.447763', NULL, 9, 'system', NULL, 'Screen 9'),
       ('2025-01-08 20:51:55.447763', NULL, 10, 'system', NULL, 'Screen 10');
INSERT INTO hanghaeho.screen (create_at, modify_at, screen_id, create_by, modify_by, name)
VALUES ('2025-01-08 20:51:55.447763', NULL, 11, 'system', NULL, 'Screen 11'),
       ('2025-01-08 20:51:55.447763', NULL, 12, 'system', NULL, 'Screen 12'),
       ('2025-01-08 20:51:55.447763', NULL, 13, 'system', NULL, 'Screen 13'),
       ('2025-01-08 20:51:55.447763', NULL, 14, 'system', NULL, 'Screen 14'),
       ('2025-01-08 20:51:55.447763', NULL, 15, 'system', NULL, 'Screen 15'),
       ('2025-01-08 20:51:55.447763', NULL, 16, 'system', NULL, 'Screen 16'),
       ('2025-01-08 20:51:55.447763', NULL, 17, 'system', NULL, 'Screen 17'),
       ('2025-01-08 20:51:55.447763', NULL, 18, 'system', NULL, 'Screen 18'),
       ('2025-01-08 20:51:55.447763', NULL, 19, 'system', NULL, 'Screen 19'),
       ('2025-01-08 20:51:55.447763', NULL, 20, 'system', NULL, 'Screen 20');
INSERT INTO hanghaeho.screen (create_at, modify_at, screen_id, create_by, modify_by, name)
VALUES ('2025-01-08 20:51:55.447763', NULL, 21, 'system', NULL, 'Screen 21'),
       ('2025-01-08 20:51:55.447763', NULL, 22, 'system', NULL, 'Screen 22'),
       ('2025-01-08 20:51:55.447763', NULL, 23, 'system', NULL, 'Screen 23'),
       ('2025-01-08 20:51:55.447763', NULL, 24, 'system', NULL, 'Screen 24'),
       ('2025-01-08 20:51:55.447763', NULL, 25, 'system', NULL, 'Screen 25'),
       ('2025-01-08 20:51:55.447763', NULL, 26, 'system', NULL, 'Screen 26'),
       ('2025-01-08 20:51:55.447763', NULL, 27, 'system', NULL, 'Screen 27');


INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 1, 1, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 1, 2, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 1, 3, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 1, 4, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 1, 5, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 1, 6, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 1, 7, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 1, 8, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 1, 9, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 1, 10, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 1, 11, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 1, 12, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 1, 13, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 1, 14, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 1, 15, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 1, 16, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 1, 17, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 1, 18, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 1, 19, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 1, 20, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 1, 21, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 1, 22, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 1, 23, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 1, 24, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 1, 25, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 2, 26, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 2, 27, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 2, 28, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 2, 29, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 2, 30, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 2, 31, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 2, 32, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 2, 33, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 2, 34, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 2, 35, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 2, 36, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 2, 37, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 2, 38, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 2, 39, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 2, 40, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 2, 41, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 2, 42, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 2, 43, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 2, 44, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 2, 45, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 2, 46, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 2, 47, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 2, 48, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 2, 49, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 2, 50, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 3, 51, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 3, 52, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 3, 53, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 3, 54, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 3, 55, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 3, 56, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 3, 57, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 3, 58, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 3, 59, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 3, 60, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 3, 61, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 3, 62, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 3, 63, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 3, 64, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 3, 65, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 3, 66, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 3, 67, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 3, 68, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 3, 69, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 3, 70, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 3, 71, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 3, 72, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 3, 73, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 3, 74, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 3, 75, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 4, 76, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 4, 77, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 4, 78, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 4, 79, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 4, 80, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 4, 81, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 4, 82, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 4, 83, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 4, 84, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 4, 85, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 4, 86, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 4, 87, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 4, 88, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 4, 89, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 4, 90, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 4, 91, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 4, 92, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 4, 93, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 4, 94, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 4, 95, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 4, 96, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 4, 97, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 4, 98, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 4, 99, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 4, 100, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 5, 101, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 5, 102, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 5, 103, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 5, 104, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 5, 105, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 5, 106, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 5, 107, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 5, 108, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 5, 109, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 5, 110, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 5, 111, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 5, 112, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 5, 113, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 5, 114, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 5, 115, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 5, 116, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 5, 117, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 5, 118, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 5, 119, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 5, 120, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 5, 121, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 5, 122, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 5, 123, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 5, 124, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 5, 125, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 6, 126, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 6, 127, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 6, 128, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 6, 129, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 6, 130, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 6, 131, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 6, 132, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 6, 133, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 6, 134, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 6, 135, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 6, 136, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 6, 137, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 6, 138, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 6, 139, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 6, 140, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 6, 141, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 6, 142, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 6, 143, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 6, 144, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 6, 145, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 6, 146, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 6, 147, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 6, 148, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 6, 149, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 6, 150, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 7, 151, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 7, 152, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 7, 153, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 7, 154, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 7, 155, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 7, 156, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 7, 157, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 7, 158, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 7, 159, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 7, 160, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 7, 161, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 7, 162, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 7, 163, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 7, 164, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 7, 165, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 7, 166, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 7, 167, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 7, 168, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 7, 169, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 7, 170, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 7, 171, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 7, 172, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 7, 173, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 7, 174, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 7, 175, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 8, 176, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 8, 177, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 8, 178, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 8, 179, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 8, 180, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 8, 181, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 8, 182, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 8, 183, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 8, 184, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 8, 185, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 8, 186, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 8, 187, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 8, 188, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 8, 189, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 8, 190, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 8, 191, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 8, 192, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 8, 193, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 8, 194, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 8, 195, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 8, 196, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 8, 197, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 8, 198, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 8, 199, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 8, 200, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 9, 201, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 9, 202, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 9, 203, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 9, 204, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 9, 205, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 9, 206, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 9, 207, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 9, 208, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 9, 209, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 9, 210, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 9, 211, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 9, 212, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 9, 213, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 9, 214, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 9, 215, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 9, 216, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 9, 217, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 9, 218, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 9, 219, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 9, 220, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 9, 221, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 9, 222, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 9, 223, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 9, 224, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 9, 225, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 10, 226, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 10, 227, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 10, 228, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 10, 229, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 10, 230, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 10, 231, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 10, 232, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 10, 233, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 10, 234, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 10, 235, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 10, 236, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 10, 237, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 10, 238, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 10, 239, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 10, 240, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 10, 241, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 10, 242, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 10, 243, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 10, 244, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 10, 245, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 10, 246, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 10, 247, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 10, 248, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 10, 249, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 10, 250, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 11, 251, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 11, 252, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 11, 253, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 11, 254, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 11, 255, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 11, 256, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 11, 257, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 11, 258, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 11, 259, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 11, 260, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 11, 261, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 11, 262, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 11, 263, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 11, 264, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 11, 265, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 11, 266, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 11, 267, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 11, 268, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 11, 269, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 11, 270, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 11, 271, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 11, 272, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 11, 273, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 11, 274, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 11, 275, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 12, 276, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 12, 277, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 12, 278, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 12, 279, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 12, 280, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 12, 281, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 12, 282, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 12, 283, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 12, 284, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 12, 285, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 12, 286, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 12, 287, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 12, 288, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 12, 289, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 12, 290, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 12, 291, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 12, 292, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 12, 293, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 12, 294, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 12, 295, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 12, 296, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 12, 297, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 12, 298, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 12, 299, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 12, 300, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 13, 301, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 13, 302, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 13, 303, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 13, 304, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 13, 305, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 13, 306, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 13, 307, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 13, 308, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 13, 309, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 13, 310, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 13, 311, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 13, 312, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 13, 313, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 13, 314, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 13, 315, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 13, 316, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 13, 317, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 13, 318, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 13, 319, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 13, 320, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 13, 321, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 13, 322, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 13, 323, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 13, 324, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 13, 325, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 14, 326, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 14, 327, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 14, 328, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 14, 329, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 14, 330, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 14, 331, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 14, 332, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 14, 333, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 14, 334, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 14, 335, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 14, 336, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 14, 337, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 14, 338, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 14, 339, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 14, 340, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 14, 341, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 14, 342, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 14, 343, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 14, 344, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 14, 345, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 14, 346, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 14, 347, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 14, 348, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 14, 349, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 14, 350, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 15, 351, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 15, 352, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 15, 353, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 15, 354, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 15, 355, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 15, 356, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 15, 357, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 15, 358, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 15, 359, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 15, 360, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 15, 361, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 15, 362, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 15, 363, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 15, 364, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 15, 365, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 15, 366, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 15, 367, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 15, 368, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 15, 369, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 15, 370, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 15, 371, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 15, 372, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 15, 373, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 15, 374, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 15, 375, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 16, 376, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 16, 377, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 16, 378, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 16, 379, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 16, 380, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 16, 381, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 16, 382, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 16, 383, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 16, 384, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 16, 385, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 16, 386, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 16, 387, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 16, 388, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 16, 389, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 16, 390, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 16, 391, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 16, 392, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 16, 393, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 16, 394, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 16, 395, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 16, 396, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 16, 397, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 16, 398, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 16, 399, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 16, 400, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 17, 401, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 17, 402, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 17, 403, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 17, 404, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 17, 405, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 17, 406, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 17, 407, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 17, 408, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 17, 409, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 17, 410, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 17, 411, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 17, 412, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 17, 413, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 17, 414, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 17, 415, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 17, 416, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 17, 417, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 17, 418, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 17, 419, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 17, 420, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 17, 421, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 17, 422, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 17, 423, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 17, 424, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 17, 425, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 18, 426, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 18, 427, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 18, 428, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 18, 429, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 18, 430, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 18, 431, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 18, 432, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 18, 433, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 18, 434, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 18, 435, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 18, 436, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 18, 437, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 18, 438, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 18, 439, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 18, 440, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 18, 441, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 18, 442, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 18, 443, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 18, 444, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 18, 445, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 18, 446, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 18, 447, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 18, 448, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 18, 449, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 18, 450, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 19, 451, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 19, 452, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 19, 453, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 19, 454, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 19, 455, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 19, 456, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 19, 457, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 19, 458, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 19, 459, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 19, 460, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 19, 461, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 19, 462, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 19, 463, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 19, 464, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 19, 465, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 19, 466, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 19, 467, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 19, 468, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 19, 469, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 19, 470, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 19, 471, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 19, 472, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 19, 473, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 19, 474, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 19, 475, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 20, 476, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 20, 477, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 20, 478, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 20, 479, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 20, 480, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 20, 481, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 20, 482, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 20, 483, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 20, 484, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 20, 485, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 20, 486, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 20, 487, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 20, 488, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 20, 489, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 20, 490, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 20, 491, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 20, 492, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 20, 493, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 20, 494, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 20, 495, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 20, 496, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 20, 497, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 20, 498, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 20, 499, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 20, 500, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 21, 501, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 21, 502, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 21, 503, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 21, 504, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 21, 505, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 21, 506, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 21, 507, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 21, 508, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 21, 509, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 21, 510, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 21, 511, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 21, 512, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 21, 513, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 21, 514, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 21, 515, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 21, 516, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 21, 517, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 21, 518, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 21, 519, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 21, 520, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 21, 521, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 21, 522, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 21, 523, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 21, 524, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 21, 525, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 22, 526, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 22, 527, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 22, 528, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 22, 529, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 22, 530, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 22, 531, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 22, 532, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 22, 533, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 22, 534, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 22, 535, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 22, 536, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 22, 537, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 22, 538, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 22, 539, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 22, 540, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 22, 541, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 22, 542, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 22, 543, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 22, 544, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 22, 545, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 22, 546, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 22, 547, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 22, 548, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 22, 549, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 22, 550, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 23, 551, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 23, 552, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 23, 553, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 23, 554, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 23, 555, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 23, 556, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 23, 557, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 23, 558, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 23, 559, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 23, 560, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 23, 561, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 23, 562, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 23, 563, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 23, 564, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 23, 565, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 23, 566, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 23, 567, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 23, 568, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 23, 569, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 23, 570, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 23, 571, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 23, 572, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 23, 573, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 23, 574, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 23, 575, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 24, 576, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 24, 577, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 24, 578, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 24, 579, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 24, 580, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 24, 581, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 24, 582, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 24, 583, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 24, 584, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 24, 585, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 24, 586, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 24, 587, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 24, 588, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 24, 589, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 24, 590, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 24, 591, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 24, 592, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 24, 593, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 24, 594, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 24, 595, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 24, 596, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 24, 597, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 24, 598, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 24, 599, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 24, 600, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 25, 601, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 25, 602, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 25, 603, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 25, 604, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 25, 605, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 25, 606, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 25, 607, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 25, 608, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 25, 609, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 25, 610, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 25, 611, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 25, 612, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 25, 613, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 25, 614, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 25, 615, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 25, 616, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 25, 617, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 25, 618, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 25, 619, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 25, 620, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 25, 621, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 25, 622, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 25, 623, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 25, 624, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 25, 625, 'system', NULL, 'E'),
       (1, '2025-01-09 09:29:08.145430', NULL, 26, 626, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 26, 627, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 26, 628, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 26, 629, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 26, 630, 'system', NULL, 'A');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 26, 631, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 26, 632, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 26, 633, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 26, 634, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 26, 635, 'system', NULL, 'B'),
       (1, '2025-01-09 09:29:08.145430', NULL, 26, 636, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 26, 637, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 26, 638, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 26, 639, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 26, 640, 'system', NULL, 'C');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 26, 641, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 26, 642, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 26, 643, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 26, 644, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 26, 645, 'system', NULL, 'D'),
       (1, '2025-01-09 09:29:08.145430', NULL, 26, 646, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 26, 647, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 26, 648, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 26, 649, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 26, 650, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 27, 651, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 27, 652, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 27, 653, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 27, 654, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 27, 655, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 27, 656, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 27, 657, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 27, 658, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 27, 659, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 27, 660, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 27, 661, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 27, 662, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 27, 663, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 27, 664, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 27, 665, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 27, 666, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 27, 667, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 27, 668, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 27, 669, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 27, 670, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, seat_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 27, 671, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 27, 672, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 27, 673, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 27, 674, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 27, 675, 'system', NULL, 'E');


INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 28, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 29, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 30, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 31, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 32, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 33, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 34, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 35, 'system', NULL, 'E');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'A'),
       (2, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'A'),
       (3, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'A'),
       (4, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'A'),
       (5, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'A'),
       (1, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'B'),
       (2, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'B'),
       (3, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'B'),
       (4, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'B'),
       (5, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'B');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'C'),
       (2, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'C'),
       (3, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'C'),
       (4, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'C'),
       (5, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'C'),
       (1, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'D'),
       (2, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'D'),
       (3, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'D'),
       (4, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'D'),
       (5, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'D');
INSERT INTO hanghaeho.seats (seat_number, create_at, modify_at, screen_id, create_by, modify_by, seat_row)
VALUES (1, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'E'),
       (2, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'E'),
       (3, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'E'),
       (4, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'E'),
       (5, '2025-01-09 09:29:08.145430', NULL, 36, 'system', NULL, 'E');
